app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles`
---
  def index
    if params[:set_locale]
      redirect_to articles_path(locale: params[:set_locale])
    else
      @q = Article.search(params[:q])

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
---
  def show
    begin
    @article = Article.find(params[:id])

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 4 LIMIT 1
---
  def edit
    begin
      @article = Article.find(params[:id])

INSERT INTO `articles` (`created_at`, `text`, `title`, `updated_at`) VALUES ('2012-08-13 08:21:27', 'fsadfd', '11', '2012-08-13 08:21:27')
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 4 LIMIT 1
UPDATE `articles` SET `title` = 'update title', `text` = 'New text', `updated_at` = '2012-08-13 11:51:20' WHERE `articles`.`id` = 980190962
---
  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])