app/controllers/news_controller.rb

  def index
    if params[:set_locale]
      redirect_to news_path(locale: params[:set_locale])
    else

    @news = News.paginate page: params[:page], order: 'created_at desc',
        per_page: 5
---
SELECT `news`.* FROM `news`

  def show
    begin
      @news = News.find(params[:id])
---
SELECT `news`.* FROM `news` WHERE `news`.`id` = 1 LIMIT 1

  def edit
    begin
    @news = News.find(params[:id])
---
SELECT `news`.* FROM `news` WHERE `news`.`id` = 1 LIMIT 1

  def create
    expire_action :action => :index
    @news = News.new(params[:news])

    respond_to do |format|
      if @news.save
---
INSERT INTO `news` (`created_at`, `text`, `title`, `updated_at`) VALUES ('2012-08-13 12:18:24', 'fsdfdsdfs', 'fds', '2012-08-13 12:18:24')

  def update
    expire_action :action => :show

    @news = News.find(params[:id])
---
SELECT `news`.* FROM `news` WHERE `news`.`id` = 980190962 LIMIT 1

  def destroy
    expire_action :action => :index
    @news = News.find(params[:id])
    @news.destroy
---
SELECT `news`.* FROM `news` WHERE `news`.`id` = 980190962 LIMIT 1
DELETE FROM `news` WHERE `news`.`id` = 980190962