app/controllers/show_controller.rb

SELECT `news`.* FROM `news` ORDER BY updated_at, desc
---
  def index
    @news = News.paginate page: params[:page], order: 'updated_at desc',
        per_page: 5